app/views/students/new.html.erb

    <div>
        <br><%= f.collection_select :club_id, Club.all, :id, :name, include_blank: "選択して下さい" %>
---
SELECT "clubs".* FROM "clubs"