app/controllers/clubs_controller.rb

  def index
    @clubs = Club.all.page(params[:page]).per(3)
---
SELECT "clubs".* FROM "clubs" LIMIT ? OFFSET ?  [["LIMIT", 3], ["OFFSET", 0]]
SELECT COUNT(*) FROM "clubs"

  def create
    @club = Club.new(club_params)
    if @club.save
---
INSERT INTO "clubs" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "あ"], ["created_at", "2024-03-07 09:23:18.936183"], ["updated_at", "2024-03-07 09:23:18.936183"]]