app/controllers/students_controller.rb

  def index
    @students = Student.all.page(params[:page]).per(5)
---
SELECT "students".* FROM "students" LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "students"

  def create
    @student = Student.new(student_params)
    if @student.save
---
INSERT INTO "students" ("student_no", "name", "club_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["student_no", "1"], ["name", "上村"], ["club_id", 1], ["created_at", "2024-03-08 14:49:48.480119"], ["updated_at", "2024-03-08 14:49:48.480119"]]